Spok1978/hybrid-radio/firmware/sdkconfig.defaults
# Значения по умолчанию для IP-Radio.
#
# История файла за один день:
#   вчера — три строки, потому что имена символов Kconfig я угадывать
#           отказалась;
#   утром — набор из ESP-ADF, examples/player/pipeline_http_mp3/
#           sdkconfig.defaults.esp32p4;
#   сейчас — за основу взят набор ВЕНДОРА ПЛАТЫ, examples/esp-idf/
#           04_wifistation репозитория waveshareteam. Он ближе к нашему
#           железу, чем общий для кристалла набор ADF.
#
# Расхождение, из-за которого пришлось переигрывать: ADF ставит PSRAM
# на 200 МГц, Waveshare — на 250. Оказалось, что **скорость PSRAM зависит
# от ревизии кристалла**: 200 для rev1.x, 250 для rev3.x. У ADF стоит
# консервативное значение, работающее на обеих. Поэтому здесь скорость
# НЕ задаётся: она приходит из профиля ревизии, см. ниже.

CONFIG_IDF_TARGET="esp32p4"

# Флеш на плате 32 МБ (GD25Q256EYIGR, подтверждено схемой).
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"

# PSRAM: в неё лягут буфер потока и рабочая память декодера.
# Скорость задаётся профилем ревизии.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Кэш и производительность — значения вендора платы.
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000

# Wi-Fi через сопроцессор ESP32-C6.
# Ключ ESP_WIFI_REMOTE_LIBRARY_HOSTED подтверждён по официальному набору
# ADF под P4; раньше был известен только по поисковой выдаче.
# Точка доступа нам не нужна — выключена, как и у вендора.
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Буферы под поток. Значения из набора ADF: интернет-радио — ровно тот
# сценарий, под который они и подбирались.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=32

CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y

# Своя таблица разделов, состав — partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --------------------------------------------------------------------
# ПРОФИЛЬ РЕВИЗИИ — ОБЯЗАТЕЛЬНО ДОБАВИТЬ ОДИН ИЗ ДВУХ
# --------------------------------------------------------------------
# Рядом лежат sdkconfig.defaults.rev1_3 и sdkconfig.defaults.rev3_x,
# взятые дословно у вендора платы. Они задают минимальную ревизию
# и скорость PSRAM. Какая ревизия у нашего экземпляра — покажет
# проверочная программа при первом запуске; до этого собирать
# по консервативному профилю rev1_3.
#
# Подключается через SDKCONFIG_DEFAULTS, например:
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.rev3_x" build
#
# --------------------------------------------------------------------
# ЧЕГО ЗДЕСЬ СОЗНАТЕЛЬНО НЕТ
# --------------------------------------------------------------------
# CONFIG_ESP32_P4_FUNCTION_EV_BOARD=y — в наборе ADF есть, но выбирает
#   звуковой HAL под плату Espressif EV-Board. У нас плата Waveshare,
#   и её в списке звуковых плат ADF нет. Нам это и не нужно: звук идёт
#   мимо штатного кодека, через свой PCM5102A по I²S.
#
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y — в наборе ADF консоль уведена
#   на USB-Serial/JTAG под их стенд. У нашей платы есть мост CH343P
#   на GPIO37/GPIO38, консоль удобнее оставить на нём.
#
# CONFIG_LVGL_PORT_ENABLE_PPA — поворот кадра. Появится вместе
#   с портом LVGL; сейчас этого символа ещё нет.

# --------------------------------------------------------------------
# Совместимость с ESP-ADF
# --------------------------------------------------------------------
# Компоненты ADF release/v2.x пользуются старыми именами FreeRTOS
# (xSemaphoreHandle, portTICK_RATE_MS), которые в ESP-IDF 5.5 убраны
# из заголовков по умолчанию. Штатный ключ возвращает их.
# Это то самое, ради чего у ADF есть каталог idf_patches: мы обходимся
# без патчей, одной опцией.
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# audio_board из ADF компилируется всегда, потому что его тянет
# audio_stream. Плату надо выбрать, иначе берётся первая по списку -
# LyraT на ESP32, и она не собирается под P4.
#
# Выбираем EV-Board НЕ потому, что пользуемся её звуковым трактом:
# мы его не трогаем, звук идёт через свой PCM5102A. Это единственный
# в списке ADF вариант на нашем кристалле, и он нужен лишь чтобы
# audio_board скомпилировался. Функции audio_board_init мы не зовём.
CONFIG_ESP32_P4_FUNCTION_EV_BOARD=y

# --------------------------------------------------------------------
# Кириллица в интерфейсе
# --------------------------------------------------------------------
# Встроенные шрифты LVGL (Montserrat) собраны только под ASCII.
# Штатный способ добавить кириллицу - конвертер lv_font_conv, но он
# на Node.js, которого на машине сборки нет.
#
# Вместо этого рендерим TTF прямо на плате: LVGL умеет это через
# lv_tiny_ttf (сборка на stb_truetype). Шрифт кладём в образ файлом,
# см. main/assets и tools/subset_font.py.
#
# Побочная выгода: размер кегля задаётся во время работы, а не при
# сборке. Двенадцать экранов из 28-screen-mockups.md пользуются шестью
# кеглями - собирать под каждый отдельную таблицу глифов не придётся.
#
# FILE_SUPPORT выключен намеренно: шрифт лежит в образе, читать его
# с карты незачем, а поддержка файлов тянет за собой лишний код.
CONFIG_LV_USE_TINY_TTF=y
# CONFIG_LV_TINY_TTF_FILE_SUPPORT is not set
CONFIG_LV_TINY_TTF_CACHE_GLYPH_CNT=256
CONFIG_LV_TINY_TTF_CACHE_KERNING_CNT=256

# Растровые Montserrat 16/20/22/28/48 включались, пока подписи были
# латиницей. Теперь их никто не зовёт: весь текст идёт нашим DejaVu.
# Компоновщик и так их выбрасывал - образ после перехода на TTF стал
# на 72 КБ меньше, - но пусть конфигурация не обещает того, чего нет.
#
# Montserrat 14 остаётся: это LV_FONT_DEFAULT, без него LVGL
# не собирается. В отрисовке он не участвует.
# CONFIG_LV_FONT_MONTSERRAT_16 is not set
# CONFIG_LV_FONT_MONTSERRAT_20 is not set
# CONFIG_LV_FONT_MONTSERRAT_22 is not set
# CONFIG_LV_FONT_MONTSERRAT_28 is not set
# CONFIG_LV_FONT_MONTSERRAT_48 is not set

# --------------------------------------------------------------------
# Профиль ревизии кристалла — ЗДЕСЬ, а не только в отдельных файлах
# --------------------------------------------------------------------
# Рядом лежат sdkconfig.defaults.rev1_3 и rev3_x, и выше написано, что
# один из них надо подключить через SDKCONFIG_DEFAULTS. На деле это
# легко пропустить: «просто idf.py build» давал образ без явной
# минимальной ревизии и скорости PSRAM, и на кристалле rev1.x он мог
# не стартовать.
#
# Поэтому консервативный профиль задан прямо здесь: он работает
# на любой ревизии. Для rev3.x есть смысл подключить rev3_x и поднять
# PSRAM до 250 МГц, но это осознанный шаг, а не условие запуска.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_SPEED=200

# --------------------------------------------------------------------
# Память LVGL: системная куча, а не свой пул
# --------------------------------------------------------------------
# По умолчанию LVGL берёт память из собственного пула фиксированного
# размера - 64 КБ. Для двенадцати экранов этого мало, и кончается она
# не сразу, а на середине построения: приборы на этом виснут молча.
#
# Именно так и вышло на живой плате 2026-08-30. При исчерпании пула
# срабатывает LV_ASSERT_MALLOC, а его обработчик по умолчанию - вечный
# цикл. В журнале это выглядело как «задача main не отдаёт процессор»
# и срабатывание сторожа, а адреса из дампа указывали то на кэш глифов,
# то на подбор кернинга - то есть на случайное место, где память
# кончилась, а не на причину.
#
# Своего пула больше нет: LVGL берёт из общей кучи, а в ней 30 МБ
# PSRAM. Держать при таком запасе статические 64 КБ незачем.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
